In [6]:
import pandas as pd

x = pd.DataFrame({"a": range(0, 10), 
                  "b": range(10, 20), 
                  "c": range(20, 30),
                  "d": range(30, 40),
                 })

In [7]:
x

   a   b   c   d
0  0  10  20  30
1  1  11  21  31
2  2  12  22  32
3  3  13  23  33
4  4  14  24  34
5  5  15  25  35
6  6  16  26  36
7  7  17  27  37
8  8  18  28  38
9  9  19  29  39

In [9]:
x.set_index("a", inplace=True)

In [10]:
x

    b   c   d
a
0  10  20  30
1  11  21  31
2  12  22  32
3  13  23  33
4  14  24  34
5  15  25  35
6  16  26  36
7  17  27  37
8  18  28  38
9  19  29  39

In [12]:
x[["c", "b"]]

    c   b
a
0  20  10
1  21  11
2  22  12
3  23  13
4  24  14
5  25  15
6  26  16
7  27  17
8  28  18
9  29  19

In [13]:
x[["c"]]

    c
a
0  20
1  21
2  22
3  23
4  24
5  25
6  26
7  27
8  28
9  29

In [14]:
x.c

a
0    20
1    21
2    22
3    23
4    24
5    25
6    26
7    27
8    28
9    29
Name: c, dtype: int64

In [15]:
print(type(x.c))
print(type(x["c"]))
print(type(x[["c"]]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [17]:
calls = 0;

def mypow(x,n):
    global calls
    calls = calls + 1
    if n < 0:
        raise Exception("Sorry, no powers below zero")
    if n == 0:
        return 1;
    if n%2 == 0:
        print(f"eben case:n={n}")
        half = mypow(x,n/2)
        return half * half
    else:
        half = mypow(x,(n-1)/2)
        return half*half*x

In [20]:
calls = 0;
print(mypow(2,5))
print(f"Calls={calls}")

eben case:n=2.0
32
Calls=4

In [21]:
calls = 0;
print(mypow(2,20))
print(f"Calls={calls}")

eben case:n=20
eben case:n=10.0
eben case:n=2.0
1048576
Calls=6

In [22]:
calls = 0;
print(mypow(2,40))
print(f"Calls={calls}")

eben case:n=40
eben case:n=20.0
eben case:n=10.0
eben case:n=2.0
1099511627776
Calls=7

In [34]:
calls = 0;
print(mypow(2,80))
print(f"Calls={calls}")

eben case:n=80
eben case:n=40.0
eben case:n=20.0
eben case:n=10.0
eben case:n=2.0
1208925819614629174706176
Calls=8